#+CONSTANTS: oldFTP=260
#+CONSTANTS: currentFTP=267

** General Build
   
*** Week 0

 | Day | Type | Set   |     | SubSet | SubSet Ins | Rest | Instruction                  |
 |-----+------+-------+-----+--------+------------+------+------------------------------|
 |   0 | FTP  | NA    |     | -      | -          | -    | -                            |
 |   1 | UDF  | NA    |   - | -      | -          | -    | 90m                          |
 |   2 | INT  | 7x5m  | 288 | -      | -          | 5m   | Constant                     |
 |   3 | UDF  | NA    |   - | -      | -          | -    | 75m                          |
 |   4 | INT  | 6x9m  | @R6 | 3x3m   |            | 6m   | 1 (easy)+ 1 (full) +1 (easy) |
 |     |      |       |     |        | 254        | -    | See problem to solve         |
 |     |      |       |     |        | 264        | -    |                              |
 |     |      |       |     |        | 267        | -    |                              |
 |   5 | INT  | 3x20m |   - | -      | -          | 15m  | Inbetween set diff           |
 |     |      |       | 235 |        |            |      |                              |
 |     |      |       | 246 |        |            |      |                              |
 |     |      |       | 238 |        |            |      |                              |
 #+TBLFM: @4$4=$currentFTP * 1.08;%.0f
 #+TBLFM: @11$4=$currentFTP * 0.88;%.0f
 #+TBLFM: @12$4=$currentFTP * 0.92;%.0f
 #+TBLFM: @13$4=$currentFTP * 0.89;%.0f
 #+TBLFM: @7$6=$currentFTP * 0.95;%.0f
 #+TBLFM: @8$6=$currentFTP * (1.1 -0.95) / 4 + $currentFTP * 0.95;%.0f
 #+TBLFM: @9$6=$currentFTP * (1.1 -0.95) / 3 + $currentFTP * 0.95;%.0f

*** Week 1

    | Day | Type | Set   |      | SubSet | SubSet Ins | Rest | Instruction        |
    |-----+------+-------+------+--------+------------+------+--------------------|
    |   0 | INT  | 3     | -    | -      | -          | -    | -                  |
    |     |      |       | R6   | 4x2m   |            | R3   | 2nd 3 sub set      |
    |     |      |       |      | ->45s  | 318        |      |                    |
    |     |      |       |      | --25s  | -3         |      | decrease           |
    |     |      |       |      |        | 310        |      |                    |
    |   1 | UDF  | NA    | -    | -      | -          | -    | 90m                |
    |   2 | INT  | 8x5m  | 286  | -      | -          | 5m   | Constant           |
    |   3 | UDF  | NA    | -    | -      | -          | -    | 60m                |
    |   4 | INT  | 7x8m  | R5.5 | 2x4m   |            | -    |                    |
    |     |      |       |      |        | 252        | -    |                    |
    |     |      |       |      |        |            | -    |                    |
    |     |      |       |      |        |            | -    |                    |
    |     |      |       |      |        |            | -    |                    |
    |   5 | INT  | 3x20m | -    | -      | -          | 15m  | Inbetween set diff |
    |     |      |       | 233  |        |            |      |                    |
    |     |      |       | 244  |        |            |      |                    |
    |     |      |       | 236  |        |            |      |                    |
    #+TBLFM: @4$6=$currentFTP * 1.2;%.0f::@8$4=$currentFTP * 1.08;%.0f::@11$6=$currentFTP * 0.95;%.0f
    #+TBLFM: @6$6=$currentFTP*1.169;%.0f

**** instaneous power converted to average power

     
     -----
          \
           \
            \
             \

     
     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     |  45 |        1.200 |   318 |
     |  70 |        1.194 |   316 |
     |  95 |        1.182 |   313 |
     | 120 |        1.169 |   310 |
     #+TBLFM: $2= (-$1^2 + 1890 $1 - 2025)/(1500 $1);%.3f
     #+TBLFM: $3= $2 * $currentFTP;%.0f



      A  B  C   D
           ____
          /    \
         /      \
     ---/        \

     B:

     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     |  60 |        0.966 |   318 |
     |  80 |        0.729 |   316 |
     | 100 |        0.593 |   313 |
     | 120 |        0.508 |   310 |
     #+TBLFM: $2= ($1 ^2 - 120 $1 + 73140)/(1200 * $1) ;%.3f

     

*** FTP test 

**** test matrix
     
     | set         | time | Power |
     |-------------+------+-------|
     | 0 warm-up   | 10 m |   156 |
     | 1 wapr-up+  | 5 m  |       |
     | --> 1.1     | 1 m  |   260 |
     | --> 1.2     | 1 m  |   130 |
     | --> 1.3     | 1 m  |   275 |
     | --> 1.4     | 1 m  |   130 |
     | --> 1.5     | 1 m  |   280 |
     | 2 rest      | 5 m  |       |
     | 3 de-       | 5 m  |   286 |
     | 4 rest      | 5 m  |       |
     | 5 test      | 20 m |       |
     | 6 cool down | 5 m  |       |
     #+TBLFM: @2$3=$oldFTP * .6;%.0f
     #+TBLFM: @4$3=$oldFTP;%.0f
     #+TBLFM: @5$3=130;%.0f
     #+TBLFM: @7$3=130;%.0f
     #+TBLFM: @8$3=$oldFTP + 20;%.0f
     #+TBLFM: @10$3=$oldFTP * 1.1;%.0f
     
     
** problem to solve

   Fang Mountain +3, i.e. Week 0 Day 4

          1.1
         /\
        /  \
   ----/    \

   .95       .95
   
   Each of the sub-set consists 3 subsections. In subsection, it is a
   3 minutes period. However, the power is not a constant during this
   period. Another issue is that the power meter shows the average
   power, so a conversion must be applied.

   - use interval timer to record 3 mins as a whole

     The best method is to tell the user for the next 20 second,
     what is the target power.

*** solution to this tri issue


         /
   -----/- 
   ----/ | 

    At the end of the first part power goes up:

    ( the average power from the begining of power ) * 2
    
       = ( power difference between the top and the bottom ) * 1 * 1/2 
   
    Using the area priciple, i.e. the area of triangle equals to the
    rectangle.

    So the power target at the end of that peak should be:

    target power = ( 1.1 - 0.95 ) * .95 / 4

    This will tell the user that s/he should put the target power for
    next 20 seconds. So, s/he would have 3 check points during the
    power surge.

    Therefore, the following section, i.e. the power down-ward period,
    the user should have a target number:

    target power = ( 1.1 - 0.95 ) * .95 / 3
